brilliantlabsAR/frame-codebase/libraries/nrf5sdk/log/src/nrf_log_backend_flash.c
static void fstorage_evt_handler(nrf_fstorage_evt_t * p_evt)
{
    if (m_state == LOG_BACKEND_FLASH_ACTIVE)
    {
        switch (p_evt->id)
        {
            case NRF_FSTORAGE_EVT_WRITE_RESULT:
            {
                if (p_evt->result == NRF_SUCCESS)
                {
                    m_curr_addr += m_curr_len;
                    m_curr_len = 0;
                    log_msg_queue_process(mp_flashlog_queue, false);
                }
                else
                {
                    m_dropped++;
                }

                if (p_evt->p_param)
                {
                    nrf_memobj_put((nrf_log_entry_t *)p_evt->p_param);
                }
                break;
            }
            default:
                break;
        }
    }
    else if ((m_state == LOG_BACKEND_FLASH_INACTIVE) &&
             (p_evt->id == NRF_FSTORAGE_EVT_ERASE_RESULT) &&
             (p_evt->addr == RUNTIME_START_ADDR))
    {
        m_state = LOG_BACKEND_FLASH_ACTIVE;
    }
}

/**
 * @brief Function for enqueueing new message.
 *
 * If queue is full then the oldest message is freed.
 *
 * @param p_queue Queue.
 * @param p_msg   Message.
 *
 * @return Number of dropped messages
 */
static uint32_t message_enqueue(nrf_queue_t const * p_queue, nrf_log_entry_t * p_msg)
{
    uint32_t dropped = 0;

    //flag was set, busy so enqueue message
    while (nrf_queue_push(p_queue, &p_msg) != NRF_SUCCESS)
    {

        nrf_log_entry_t * p_old_msg;
        if (nrf_queue_pop(p_queue, &p_old_msg) == NRF_SUCCESS)
        {
            nrf_memobj_put(p_old_msg);
            dropped++;
        }
    }

    return dropped;
}


void nrf_log_backend_flashlog_put(nrf_log_backend_t const * p_backend,
                                  nrf_log_entry_t * p_msg)
{
    if (m_state == LOG_BACKEND_FLASH_ACTIVE)
    {
        nrf_memobj_get(p_msg);

        m_dropped += message_enqueue(mp_flashlog_queue, p_msg);

        if (nrf_atomic_flag_set_fetch(&m_busy_flag) == 0)
        {
            log_msg_queue_process(mp_flashlog_queue, false);
        }
    }
}


void nrf_log_backend_crashlog_put(nrf_log_backend_t const * p_backend,
                                  nrf_log_entry_t * p_msg)
{
    if (m_state != LOG_BACKEND_FLASH_INACTIVE)
    {
        nrf_memobj_get(p_msg);

        UNUSED_RETURN_VALUE(message_enqueue(mp_crashlog_queue, p_msg));
    }

    if (m_state == LOG_BACKEND_FLASH_IN_PANIC)
    {
        log_msg_queue_process(mp_crashlog_queue, true);
    }
}

void nrf_log_backend_flashlog_flush(nrf_log_backend_t const * p_backend)
{
    queue_element_drop(mp_flashlog_queue);
}

void nrf_log_backend_crashlog_flush(nrf_log_backend_t const * p_backend)
{
    queue_element_drop(mp_crashlog_queue);
}

void nrf_log_backend_flashlog_panic_set(nrf_log_backend_t const * p_backend)
{
    /* Empty */
}

/**
 * @brief Function for injecting log message which will indicate start of crash log.
 */
static void crashlog_marker_inject(void)
{
    nrf_log_header_t crashlog_marker_hdr = {
            .base = {
                .std = {
                     .type = HEADER_TYPE_STD,
                     .severity = NRF_LOG_SEVERITY_INFO_RAW,
                     .nargs = 0,
                     .addr = (uint32_t)crashlog_str & STD_ADDR_MASK
                }
            },
            .module_id = 0,
            .timestamp = 0,
    };
    m_flash_buf[0] = crashlog_marker_hdr.base.raw;
    m_flash_buf[1] = crashlog_marker_hdr.module_id;
    m_flash_buf[2] = crashlog_marker_hdr.timestamp;
    (void)nrf_fstorage_write(&m_log_flash_fstorage, m_curr_addr, m_flash_buf, LOG_HEADER_LEN, NULL);
    m_curr_addr += LOG_HEADER_LEN;
}


void nrf_log_backend_crashlog_panic_set(nrf_log_backend_t const * p_backend)
{
    if (nrf_fstorage_init(&m_log_flash_fstorage, &nrf_fstorage_nvmc, NULL) == NRF_SUCCESS)
    {
        m_state = LOG_BACKEND_FLASH_IN_PANIC;

        /* In case of Softdevice MWU may protect access to NVMC. */
        NVIC_DisableIRQ(MWU_IRQn);

        log_msg_queue_process(mp_flashlog_queue, true);

        crashlog_marker_inject();

        log_msg_queue_process(mp_crashlog_queue, true);
    }
    else
    {
        m_state = LOG_BACKEND_FLASH_INACTIVE;
    }
}

/**
 * @brief Function for determining first empty location in area dedicated for flash logger backend.
 */
static uint32_t empty_addr_get(void)
{
    uint32_t token = 0;
    nrf_log_header_t * p_dummy_header;
    uint8_t * p_dummy_data;

    while(nrf_log_backend_flash_next_entry_get(&token, &p_dummy_header, &p_dummy_data) == NRF_SUCCESS)
    {

    }

    return token;
}


ret_code_t nrf_log_backend_flash_init(nrf_fstorage_api_t const * p_fs_api)
{
    ret_code_t err_code;


    uint32_t start_addr = RUNTIME_START_ADDR;
    uint32_t end_addr   = start_addr + FLASH_LOG_SIZE - 1;

    m_log_flash_fstorage.start_addr = start_addr;
    m_log_flash_fstorage.end_addr   = end_addr;

    err_code = nrf_fstorage_init(&m_log_flash_fstorage, p_fs_api, NULL);
    if (err_code != NRF_SUCCESS)
    {
        return err_code;
    }

    m_curr_addr = empty_addr_get();
    m_state  = LOG_BACKEND_FLASH_ACTIVE;

    return err_code;
}


ret_code_t nrf_log_backend_flash_next_entry_get(uint32_t *                p_token,
                                                nrf_log_header_t * *      pp_header,
                                                uint8_t * *               pp_data)
{
    uint32_t * p_addr = p_token;
    uint32_t   len;

    *p_addr = (*p_addr == 0) ? RUNTIME_START_ADDR : *p_addr;

    if (nrf_fstorage_rmap(&m_log_flash_fstorage, *p_addr) == NULL)
    {
        //Supports only memories which can be mapped for reading.
        return NRF_ERROR_NOT_SUPPORTED;
    }

    if (msg_from_buf((uint32_t *)*p_addr, pp_header, pp_data, &len))
    {
        *p_addr += len;
        return NRF_SUCCESS;
    }
    else
    {
        return NRF_ERROR_NOT_FOUND;
    }
}


ret_code_t nrf_log_backend_flash_erase(void)
{
    ret_code_t err_code;

    m_state = LOG_BACKEND_FLASH_INACTIVE;
    err_code = nrf_fstorage_erase(&m_log_flash_fstorage, RUNTIME_START_ADDR, NRF_LOG_BACKEND_PAGES, NULL);
    
    m_curr_addr = RUNTIME_START_ADDR;

    return err_code;
}

